Revit 2024 API
ExternalResourceType Class
 A type class used to distinguish between different kinds of external resource.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public class ExternalResourceType : GuidEnum
Visual Basic
Public Class ExternalResourceType _
	Inherits GuidEnum
Visual C++
public ref class ExternalResourceType : public GuidEnum
Remarks
 Revit elements can consume multiple types of external resource data, provided by one or more external servers. Conversely, external servers can support one, or more than one, type of external resource.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.GuidEnum
 Autodesk.Revit.DB.ExternalResourceType
See Also
ExternalResourceType Members
Autodesk.Revit.DB Namespace